app/views/home/index.html.erb

SELECT  1 AS one FROM "documents" WHERE "documents"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT "documents".* FROM "documents" WHERE "documents"."user_id" = ?  [["user_id", 1]]
---
</div>
<% if current_user.documents.any? %>